{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 160, 320], "input_dtype": "float32", "target_shape": [160, 320, 1], "name": "reshape_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 8, "name": "convolution2d_1", "activation": "linear", "b_regularizer": null, "nb_col": 8, "nb_filter": 24, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "activation": "linear", "b_regularizer": null, "nb_col": 5, "nb_filter": 36, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "activation": "linear", "b_regularizer": null, "nb_col": 5, "nb_filter": 48, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "activation": "linear", "b_regularizer": null, "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 2, "name": "convolution2d_5", "activation": "linear", "b_regularizer": null, "nb_col": 2, "nb_filter": 64, "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_5", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "activation": "linear", "b_regularizer": null, "output_dim": 1024, "b_constraint": null, "input_dim": 1536, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "activation": "linear", "b_regularizer": null, "output_dim": 512, "b_constraint": null, "input_dim": 1024, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "activation": "linear", "b_regularizer": null, "output_dim": 256, "b_constraint": null, "input_dim": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "activation": "linear", "b_regularizer": null, "output_dim": 128, "b_constraint": null, "input_dim": 256, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_5", "activation": "linear", "b_regularizer": null, "output_dim": 32, "b_constraint": null, "input_dim": 128, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "tanh"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_6", "activation": "linear", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "input_dim": 32, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}], "keras_version": "1.2.0"}