{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Reshape", "config": {"input_dtype": "float32", "trainable": true, "name": "reshape_1", "batch_input_shape": [null, 160, 320], "target_shape": [160, 320, 1]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_filter": 24, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_col": 7, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_row": 7, "W_constraint": null, "activation": "linear", "border_mode": "same", "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_filter": 36, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "W_constraint": null, "activation": "linear", "border_mode": "same", "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_filter": 48, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "W_constraint": null, "activation": "linear", "border_mode": "same", "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "linear", "border_mode": "same", "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "activation": "linear", "border_mode": "same", "bias": true, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_5", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 3200, "trainable": true, "output_dim": 1024, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "trainable": true, "output_dim": 512, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 512, "trainable": true, "output_dim": 256, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 256, "trainable": true, "output_dim": 128, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"name": "dense_5", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 128, "trainable": true, "output_dim": 32, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_10"}}, {"class_name": "Dense", "config": {"name": "dense_6", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 32, "trainable": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear"}}]}